In [1]:
import pandas as pd

In [2]:
pd.read_excel(r'C:\Users\manne\OneDrive\Desktop\Book2.xlsx')

      name    batch  rollno grade
0    manoj  phython      78     a
1   suyoig  phython      89     b
2   chitan  phython      76     c
3  prakash  phython      67     d

In [4]:
pd.read_csv(r'C:\Users\manne\OneDrive\Desktop\mycsv.csv')

      name    grade    address  phoenumber
0   visesh        A      NOIDA     7475875
1   aditya      a++  bangalore      995134
2    Allen  phython   hyderbad       88990
3  prakash  phython     london      908989

In [5]:
pd.read_csv(r'C:\Users\manne\OneDrive\Desktop\mytsv.txt')

        name\temailid\tbatch
0  allen\tallen@fmail.com\t1